import os

import cv2
import numpy as np
import pandas as pd

from solution_example import get_foreground_mask, get_foreground_mask_with_watershed


def evaluate_iou(image_dir: str, anno_dir: str, with_watershed: bool = False) -> tuple:
    """
    Метод для расчёта mean IoU на датасете
    :param image_dir - каталог с фото для анализа
    :param anno_dir - каталог с аннотациями для расчета метрики
    :param with_watershed - выбор функции запуска
    :return значение mean IoU с сохранением оценки по каждому фото в csv-файл
    """

    iou_data = dict()
    total_time_mp = 0
    for _, _, files in os.walk(image_dir):
        assert files is not None, 'no files read'
        for image_name in files:
            # print(f'Processing file {image_name}')
            sample_name = image_name[:image_name.find('.jpg')]

            # acquiring ground truth mask data
            mask_true = cv2.imread(os.path.join(anno_dir, f'{sample_name}.png'))
            assert mask_true is not None, 'mask is None'
            true_points = cv2.cvtColor(mask_true, cv2.COLOR_BGR2GRAY)
            true_points[true_points != 2] = 1
            true_points[true_points == 2] = 0
            true_points = np.argwhere(true_points)
            true_points_set = set([tuple(x) for x in true_points])

            # acquiring predicted mask
            processor = get_foreground_mask if not with_watershed else get_foreground_mask_with_watershed
            pred_points, working_time = processor(image_path=os.path.join(image_dir, image_name))
            assert pred_points is not None, 'pred_points is None'
            total_time_mp += working_time
            pred_points_set = set([tuple(x) for x in pred_points])

            # calculating IoU
            iou = len(true_points_set.intersection(pred_points_set)) / len(true_points_set.union(pred_points_set))

            image_names = iou_data.get('image_names', [])
            image_names.append(sample_name)
            iou_data['image_names'] = image_names

            iou_values = iou_data.get('iou_values', [])
            iou_values.append(iou)
            iou_data['iou_values'] = iou_values

        pd.DataFrame(data=iou_data).to_csv('detailed_results.csv')
        return np.mean(iou_data['iou_values']), total_time_mp / len(files)

# 0.8561712968070165: d=5, e=5, w=False
# 0.7962183313288164: d=5, e=5, w=True
# 0.8453748477088093: d=5, e=6, w=False
# 0.7734753661026414: d=5, e=6, w=True
# 0.8327085921904291: d=5, e=7, w=False
# 0.7500599170879483: d=5, e=7, w=True
# 0.8189137775519224: d=5, e=8, w=False
# 0.726587301482318: d=5, e=8, w=True
# 0.8043074564533045: d=5, e=9, w=False
# 0.7031954132493269: d=5, e=9, w=True
# 0.7892141625272425: d=5, e=10, w=False
# 0.6800762645610913: d=5, e=10, w=True
# 0.7735241567890196: d=5, e=11, w=False
# 0.6571465786237717: d=5, e=11, w=True
# 0.7576245777259955: d=5, e=12, w=False
# 0.6346838731527611: d=5, e=12, w=True
# 0.7416654926289994: d=5, e=13, w=False
# 0.6127754979111875: d=5, e=13, w=True
# 0.7257462183316333: d=5, e=14, w=False
# 0.5914843178519869: d=5, e=14, w=True
# 0.7098872381118935: d=5, e=15, w=False
# 0.570820517583614: d=5, e=15, w=True
# 0.8684127578497666: d=6, e=5, w=False
# 0.828970875922343: d=6, e=5, w=True
# 0.8607020314117173: d=6, e=6, w=False
# 0.8113784285799472: d=6, e=6, w=True
# 0.8513086449814332: d=6, e=7, w=False
# 0.7924693063607948: d=6, e=7, w=True
# 0.8401651265783826: d=6, e=8, w=False
# 0.7727087700994987: d=6, e=8, w=True
# 0.827957109502759: d=6, e=9, w=False
# 0.7526980411109712: d=6, e=9, w=True
# 0.8149673768403166: d=6, e=10, w=False
# 0.7326118100287446: d=6, e=10, w=True
# 0.8014821471982397: d=6, e=11, w=False
# 0.7126184971986017: d=6, e=11, w=True
# 0.7873783593712764: d=6, e=12, w=False
# 0.6925946030881173: d=6, e=12, w=True
# 0.7730250399884439: d=6, e=13, w=False
# 0.6728109974764146: d=6, e=13, w=True
# 0.7584505944634459: d=6, e=14, w=False
# 0.6532692908245551: d=6, e=14, w=True
# 0.7438232775803766: d=6, e=15, w=False
# 0.6340764543925679: d=6, e=15, w=True
# 0.8763049140578425: d=7, e=5, w=False
# 0.8517495420913952: d=7, e=5, w=True
# 0.8708657718128643: d=7, e=6, w=False
# 0.8377682407054956: d=7, e=6, w=True
# 0.8640012624910629: d=7, e=7, w=False
# 0.8225041487569352: d=7, e=7, w=True
# 0.855573400822013: d=7, e=8, w=False
# 0.8060455035495155: d=7, e=8, w=True
# 0.8454592545343411: d=7, e=9, w=False
# 0.7886683416014652: d=7, e=9, w=True
# 0.8342949779651895: d=7, e=10, w=False
# 0.7709069622472231: d=7, e=10, w=True
# 0.8223733559691883: d=7, e=11, w=False
# 0.7529259868823672: d=7, e=11, w=True
# 0.8099475064793914: d=7, e=12, w=False
# 0.7349341591574805: d=7, e=12, w=True
# 0.7968201857042229: d=7, e=13, w=False
# 0.7167842875836326: d=7, e=13, w=True
# 0.7833959091239775: d=7, e=14, w=False
# 0.6987261361708428: d=7, e=14, w=True
# 0.7697171173115172: d=7, e=15, w=False
# 0.6808189774343867: d=7, e=15, w=True
# 0.8808241303017322: d=8, e=5, w=False
# 0.8679289622580997: d=8, e=5, w=True
# 0.877724441231382: d=8, e=6, w=False
# 0.8570997030124731: d=8, e=6, w=True
# 0.8729385698321113: d=8, e=7, w=False
# 0.8445998588196879: d=8, e=7, w=True
# 0.8668181793394192: d=8, e=8, w=False
# 0.8309460569542795: d=8, e=8, w=True
# 0.8592340808948933: d=8, e=9, w=False
# 0.8161377466325813: d=8, e=9, w=True
# 0.8500256699854407: d=8, e=10, w=False
# 0.8003616684764852: d=8, e=10, w=True
# 0.8398001331870433: d=8, e=11, w=False
# 0.7841509496765084: d=8, e=11, w=True
# 0.8287939914119512: d=8, e=12, w=False
# 0.7675908663296461: d=8, e=12, w=True
# 0.8172667689093336: d=8, e=13, w=False
# 0.7509376516125159: d=8, e=13, w=True
# 0.8050597474997473: d=8, e=14, w=False
# 0.7340673752924185: d=8, e=14, w=True
# 0.7924906127952975: d=8, e=15, w=False
# 0.7171946960790452: d=8, e=15, w=True
# 0.8817695763546424: d=9, e=5, w=False
# 0.8790973589646838: d=9, e=5, w=True
# 0.8811183927961305: d=9, e=6, w=False
# 0.8715891642711066: d=9, e=6, w=True
# 0.8784077866795232: d=9, e=7, w=False
# 0.8619008666138676: d=9, e=7, w=True
# 0.8740627535452558: d=9, e=8, w=False
# 0.850622394912913: d=9, e=8, w=True
# 0.8684456567938099: d=9, e=9, w=False
# 0.8382596793217814: d=9, e=9, w=True
# 0.8614202969015197: d=9, e=10, w=False
# 0.8247294948558472: d=9, e=10, w=True
# 0.8528668008988537: d=9, e=11, w=False
# 0.8101573381370473: d=9, e=11, w=True
# 0.8432823248709788: d=9, e=12, w=False
# 0.7951366507099388: d=9, e=12, w=True
# 0.8329089070334671: d=9, e=13, w=False
# 0.7797227788983241: d=9, e=13, w=True
# 0.8220446801519894: d=9, e=14, w=False
# 0.7641752691603605: d=9, e=14, w=True
# 0.8105169826187292: d=9, e=15, w=False
# 0.7483662599424146: d=9, e=15, w=True
# 0.8797560403595829: d=10, e=5, w=False
# 0.8854563954998673: d=10, e=5, w=True
# 0.8817344781662672: d=10, e=6, w=False
# 0.8815797272049314: d=10, e=6, w=True
# 0.8812595028322522: d=10, e=7, w=False
# 0.8748795336923467: d=10, e=7, w=True
# 0.8787712880958485: d=10, e=8, w=False
# 0.8660868321381876: d=10, e=8, w=True
# 0.8746913050445524: d=10, e=9, w=False
# 0.8557678749406712: d=10, e=9, w=True
# 0.8693592557593801: d=10, e=10, w=False
# 0.8444188808060713: d=10, e=10, w=True
# 0.8626937140839049: d=10, e=11, w=False
# 0.8319216039737799: d=10, e=11, w=True
# 0.8546157003581726: d=10, e=12, w=False
# 0.818312145757434: d=10, e=12, w=True
# 0.8455199978708906: d=10, e=13, w=False
# 0.804198859605475: d=10, e=13, w=True
# 0.83563986828876: d=10, e=14, w=False
# 0.7896871557187524: d=10, e=14, w=True
# 0.8252946262098126: d=10, e=15, w=False
# 0.7750221429814078: d=10, e=15, w=True
# 0.8750241976405063: d=11, e=5, w=False
# 0.8873527070681401: d=11, e=5, w=True
# 0.879440083881949: d=11, e=6, w=False
# 0.8870197976904487: d=11, e=6, w=True
# 0.881568173286409: d=11, e=7, w=False
# 0.8837305984397296: d=11, e=7, w=True
# 0.8813253038475551: d=11, e=8, w=False
# 0.8777095434148401: d=11, e=8, w=True
# 0.8791278652649912: d=11, e=9, w=False
# 0.8696965240134678: d=11, e=9, w=True
# 0.8753964262840289: d=11, e=10, w=False
# 0.8602139240892569: d=11, e=10, w=True
# 0.8704528016278179: d=11, e=11, w=False
# 0.8497420445787628: d=11, e=11, w=True
# 0.864198597715497: d=11, e=12, w=False
# 0.8381404545658785: d=11, e=12, w=True
# 0.8565804316822665: d=11, e=13, w=False
# 0.8254035704385787: d=11, e=13, w=True
# 0.8479486678534733: d=11, e=14, w=False
# 0.8121202180811409: d=11, e=14, w=True
# 0.8385225456075136: d=11, e=15, w=False
# 0.798354049437816: d=11, e=15, w=True
# 0.8677709102597616: d=12, e=5, w=False
# 0.8850695142746277: d=12, e=5, w=True
# 0.8743854878537008: d=12, e=6, w=False
# 0.8880836096296081: d=12, e=6, w=True
# 0.8788505392955872: d=12, e=7, w=False
# 0.8881321915481525: d=12, e=7, w=True
# 0.881075771458556: d=12, e=8, w=False
# 0.8853005733904987: d=12, e=8, w=True
# 0.8810027628059468: d=12, e=9, w=False
# 0.8798093658051291: d=12, e=9, w=True
# 0.8790492254824361: d=12, e=10, w=False
# 0.8723948868597526: d=12, e=10, w=True
# 0.8755838937811372: d=12, e=11, w=False
# 0.8635799416070848: d=12, e=11, w=True
# 0.8709168690025002: d=12, e=12, w=False
# 0.8538115751668777: d=12, e=12, w=True
# 0.8649982928883816: d=12, e=13, w=False
# 0.8429377366004774: d=12, e=13, w=True
# 0.8577983798887108: d=12, e=14, w=False
# 0.830938808430913: d=12, e=14, w=True
# 0.8495944347711554: d=12, e=15, w=False
# 0.8183425287609661: d=12, e=15, w=True
# 0.8588308964517831: d=13, e=5, w=False
# 0.8798904129050514: d=13, e=5, w=True
# 0.8669736353400637: d=13, e=6, w=False
# 0.8854325381115327: d=13, e=6, w=True
# 0.87355213908549: d=13, e=7, w=False
# 0.8887023025723241: d=13, e=7, w=True
# 0.878072917737902: d=13, e=8, w=False
# 0.8891113403142396: d=13, e=8, w=True
# 0.8804153367528632: d=13, e=9, w=False
# 0.8867161503133538: d=13, e=9, w=True
# 0.880518477873666: d=13, e=10, w=False
# 0.8817310667742168: d=13, e=10, w=True
# 0.8788117081808504: d=13, e=11, w=False
# 0.8748838965000716: d=13, e=11, w=True
# 0.875625054567075: d=13, e=12, w=False
# 0.8666802453198449: d=13, e=12, w=True
# 0.871261398514998: d=13, e=13, w=False
# 0.8575555737404494: d=13, e=13, w=True
# 0.8656907292357988: d=13, e=14, w=False
# 0.8473602323444013: d=13, e=14, w=True
# 0.8589098966991613: d=13, e=15, w=False
# 0.8361092625988529: d=13, e=15, w=True
# 0.8488507355179432: d=14, e=5, w=False
# 0.8726210475528505: d=14, e=5, w=True
# 0.8579837113282918: d=14, e=6, w=False
# 0.8800235058972062: d=14, e=6, w=True
# 0.8660377550369784: d=14, e=7, w=False
# 0.8857145118279927: d=14, e=7, w=True
# 0.8725542578360173: d=14, e=8, w=False
# 0.8892064411982534: d=14, e=8, w=True
# 0.8770962911512429: d=14, e=9, w=False
# 0.8899000259101365: d=14, e=9, w=True
# 0.8795236033324645: d=14, e=10, w=False
# 0.8878817608109744: d=14, e=10, w=True
# 0.8797410133439842: d=14, e=11, w=False
# 0.8833163247195941: d=14, e=11, w=True
# 0.8781929329068202: d=14, e=12, w=False
# 0.8769042494190008: d=14, e=12, w=True
# 0.8752015447748565: d=14, e=13, w=False
# 0.8691588697314078: d=14, e=13, w=True
# 0.8710552462120998: d=14, e=14, w=False
# 0.860524672436331: d=14, e=14, w=True
# 0.8657255460507409: d=14, e=15, w=False
# 0.8508540806966538: d=14, e=15, w=True
# 0.8381760762328827: d=15, e=5, w=False
# 0.8640935945327205: d=15, e=5, w=True
# 0.8477900218178448: d=15, e=6, w=False
# 0.8727275989018384: d=15, e=6, w=True
# 0.8567576022631492: d=15, e=7, w=False
# 0.88026934032834: d=15, e=7, w=True
# 0.8646634735935845: d=15, e=8, w=False
# 0.886144616619621: d=15, e=8, w=True
# 0.8710808450468289: d=15, e=9, w=False
# 0.8898868621778235: d=15, e=9, w=True
# 0.8755646259949799: d=15, e=10, w=False
# 0.8909250653725945: d=15, e=10, w=True
# 0.8779876500273172: d=15, e=11, w=False
# 0.8893306662011401: d=15, e=11, w=True
# 0.8782830697769871: d=15, e=12, w=False
# 0.8852632651325508: d=15, e=12, w=True
# 0.8768563628298568: d=15, e=13, w=False
# 0.8793923274263178: d=15, e=13, w=True
# 0.8740295378774506: d=15, e=14, w=False
# 0.8722079965670353: d=15, e=14, w=True
# 0.8700832096873222: d=15, e=15, w=False
# 0.8641635005092441: d=15, e=15, w=True
# 0.8909250653725945


# 0.8740178413356325: d=16, e=11, w=False
# 0.8910094920292528: d=16, e=11, w=True
# 0.8764749094660074: d=16, e=12, w=False
# 0.8896880152304091: d=16, e=12, w=True
# 0.8768529855074408: d=16, e=13, w=False
# 0.8859664438958121: d=16, e=13, w=True
# 0.8755469700960429: d=16, e=14, w=False
# 0.880506804495961: d=16, e=14, w=True
# 0.8728955475549209: d=16, e=15, w=False
# 0.8737674868572622: d=16, e=15, w=True
# 0.8691598139957349: d=16, e=16, w=False
# 0.8661735936541392: d=16, e=16, w=True
# 0.8642870639891922: d=16, e=17, w=False
# 0.8576402700508503: d=16, e=17, w=True
# 0.8674345134805428: d=17, e=11, w=False
# 0.8890241456264413: d=17, e=11, w=True
# 0.8718087125337215: d=17, e=12, w=False
# 0.8904627124711336: d=17, e=12, w=True
# 0.8742536215290407: d=17, e=13, w=False
# 0.8893562129288494: d=17, e=13, w=True
# 0.8747516460765395: d=17, e=14, w=False
# 0.885933315122988: d=17, e=14, w=True
# 0.8736613806602996: d=17, e=15, w=False
# 0.8808269246706562: d=17, e=15, w=True
# 0.8712596465047077: d=17, e=16, w=False
# 0.8744726152238704: d=17, e=16, w=True
# 0.8678033678266247: d=17, e=17, w=False
# 0.8672859837989592: d=17, e=17, w=True
# 0.8910094920292528

